{
  "users": [
    {
      "email": "slava@mail.ru",
      "password": "$2a$10$J3toAHbi7IKp0FYkLlml5elK9RSNhdp1EWxspt5vgSHHKmXWhAOoK",
      "id": 1
    },
    {
      "email": "kate@mail.ru",
      "password": "$2a$10$GRl2WDlUfc7g067GyEdvX.6SArIXQWiYzZ0aYV4nmCw.NW//r0Kfy",
      "id": 2
    }
  ],
  "accounts": [
    {
      "nickname": "n",
      "about": "q",
      "login": "slava@mail.ru",
      "id": 1
    },
    {
      "nickname": "cs",
      "about": "about",
      "login": "slava@mail.ru",
      "id": 2
    },
    {
      "nickname": "sd",
      "about": "csa",
      "login": "slava@mail.ru",
      "id": 3
    },
    {
      "nickname": "Kate",
      "about": "desc",
      "login": "kate@mail.ru",
      "id": 4
    },
    {
      "nickname": "",
      "about": "",
      "login": "kate@mail.ru",
      "id": 5
    },
    {
      "nickname": "Last",
      "about": "desc",
      "login": "kate@mail.ru",
      "id": 6
    }
  ],
  "articles": [
    {
      "id": 1,
      "author": "kate@mail.ru",
      "title": "Рекомендации по книгам: 10 лучших для изучения программирования",
      "text": "При изучении программирования важно иметь под рукой качественные и полезные книги, которые помогут быстрее освоить новые знания и навыки. В этой статье мы представляем вашему вниманию 10 книг, которые, по нашему мнению, являются лучшими для изучения программирования."
    },
    {
      "author": "kate@mail.ru",
      "title": "Обзор популярных языков программирования: какой выбрать для начала обучения?",
      "text": "Выбор языка программирования является одним из самых важных решений для начинающего разработчика. От этого зависит не только скорость и легкость изучения основ программирования, но и перспективы карьерного роста, а также возможность работать в различных сферах IT-индустрии. В данной статье мы рассмотрим наиболее популярные языки программирования и их особенности, которые могут повлиять на ваш выбор",
      "id": 2
    },
    {
      "author": "kate@mail.ru",
      "title": "Как не выгореть?",
      "text": "В данной статье я расскажу про 5 методов, которые помогут быть \"здоровым\".\n            Выгорание – это состояние эмоционального, физического и психологического истощения, вызванное длительным стрессом на работе или в личной жизни. Оно может привести к серьезным негативным последствиям для здоровья, таким как депрессия, тревожность, бессонница, проблемы с сердцем и другие.\n            В этой статье мы рассмотрим 5 методов, помогающих избежать выгорания и сохранять здоровье.\n            1. Баланс между работой и личной жизнью. Очень важно соблюдать баланс между профессиональной и личной жизнью, чтобы избежать стресса и выгорания. Не стоит забывать о своих увлечениях, хобби, семье и друзьях. Важно уметь переключать внимание с работы на другие аспекты жизни.\n            2. Отдых и релаксация. Регулярный отдых и релаксация помогут избежать выгорания. Найдите время для занятий, которые приносят вам удовольствие и радость, таких как прогулки на природе, чтение книг, просмотр фильмов, общение с друзьями. Также можно использовать техники релаксации, такие как медитация, йога или дыхательные упражнения.\n            3. Здоровый образ жизни. Правильное питание, регулярные физические нагрузки и достаточный сон помогут сохранить здоровье и избежать выгорания. Старайтесь питаться правильно, уделяйте время физическим упражнениям и спите не менее 7-8 часов в сутки.\n            4. Профессиональное развитие. Постоянное обучение и развитие своих навыков поможет избежать выгорания, так как это дает новые стимулы и цели в жизни. Участвуйте в профессиональных конференциях, проходите курсы, читайте книги по своей специальности.\n            5. Психологическая поддержка. Если вы чувствуете, что не справляетесь со стрессом и выгоранием, не стесняйтесь обратиться за помощью к психологу или психотерапевту. Профессиональная помощь может помочь вам справиться с негативными эмоциями и вернуться к нормальной жизни.\n            В заключении, важно помнить, что выгорание - это не приговор, и его можно избежать, если следовать указанным методам и заботиться о своем здоровье и благополучии!",
      "id": 3
    },
    {
      "title": "My first article",
      "text": "long text_long text_long text_long text_long text_long text_long text_long text_long text_long text_long text_long text_long text_long text_long text_long text_long text_long text_long text_long text_long text_long text_long text_long text_long text_long text_long text_long text_long text_long text_long text_long text_long text_long text_long text_long text_long text_long text_long text_long text",
      "author": "kate@mail.ru",
      "id": 4
    },
    {
      "title": "My first article",
      "text": "long text_long text_long text_long text_long text_long text_long text_long text_long text_long text_long text_long text_long text_long text_long text_long text_long text_long text_long text_long text_long text_long text_long text_long text_long text_long text_long text_long text_long text_long text_long text_long text_long text_long text_long text_long text_long text_long text_long text_long text",
      "author": "kate@mail.ru",
      "id": 5
    },
    {
      "title": "second",
      "text": "second text",
      "author": "kate@mail.ru",
      "id": 6
    },
    {
      "title": "third",
      "text": "nickname check",
      "author": "Last",
      "id": 7
    }
  ]
}